run/tube_gas_decay/0.orig/molarConc
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      molarConc;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    table
        ( 
            (0      0)
            (5   2000)
            (10     0)
        );
    }

    outlet
    {
        type            zeroGradient;
        //value          uniform 1000;
    }

    tubeWall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
